/**
 * 手机号码分为联通，电信和移动
 * 电信手机号开头，2G/3G [133， 153，180， 181， 189]， 4G [177]
 * 联通手机号开头，2G[130,131,132,155, 156] 3G[145,185,186], 4G[176,185[1]] 
 * 移动手机号开头，2G[13x(0-8), 135,136,137,138,139,150,151,152,158,159,182,183,184]
 *              3G[157,187,188, 147] 4G[178]
 * 
 * 小结， 手机号的第一位1是 1开头， 第二位是【3，4，5，7，8】,第三位是 [0-9],第三位之后的数字均为[0-9] 
 */

 //1. 符合手机号验证的正则表达式
//  var phoneReg1 = /^1[3|4|5|7|8]\d{9}$/
//  var phoneNum1 = '15507621999'
//  var phoneNum2 = '19507621999'
//  console.log(phoneReg1.test(phoneNum1));
//  console.log(phoneReg1.test(phoneNum2))

 // 2. 但是第二位的很可能增加一个，比如16，19 开头，保险起见，第二位不验证，最终的正则是
 var phoneReg2 = /^1\d{10}$/;
 console.log(phoneReg2.test(phoneNum1));
 console.log(phoneReg2.test(phoneNum2))